<template>
  <div class="options__rules frame-orange shadow-h-orange bg-bg">
    <h1 class="bg-orange">Правила игры</h1>
    <div class="options__rules-body scroll-orange">
      <h3>Механика игры</h3>
      <p>
        Во время активной фазы волны (длится 25 секунд) появляются враги, которые двигаются в сторону башни, и которые
        усиливаются с каждой новой волной, а также увеличивается их количество. Первоначальная сложность врагов зависит
        от уровня игры, но уровень также влияет на награду за волны и за убийство врагов.
      </p>
      <p>
        После окончания активной фазы волны начинается перезарядка (длится 5 секунд), во время которой враги не
        появляются.
      </p>
      <p>Каждую 10-ю волну появляется Босс с увеличенными характеристиками.</p>
      <p>Игра завершается, когда у башни не остаётся жизней.</p>
      <h3>Задача игрока</h3>
      <p>
        Задача башни уничтожить врагов до того момента, как они нанесут урон. Убивая врагов игрок получается валюту
        <VIcon :name="'dollar'" :color="'green'" /> и монеты <VIcon :name="'coins'" :color="'yellow'" />, за которые
        может покупать себе улучшения для усиления башни. Игрок может усилить характеристики своей башни за счёт
        улучшений, карт, исследований в лаборатории и модернизации модулей башни.
      </p>
      <h3>Усиления башни</h3>
      <p>
        Улучшения за валюту <VIcon :name="'dollar'" :color="'green'" /> действуют только в рамках одной игры. Улучшения
        за монеты <VIcon :name="'coins'" :color="'yellow'" /> влияют на уровень улучшений с которыми игрок начинает
        новую игру. Усиления деляться на несколько категорий: Атака, Башня, Периметр, Валюта и Ультимейт.
      </p>
      <h3>Карты</h3>
      <p>
        Игрок за алмазы <VIcon :name="'diamond'" :color="'turq'" /> может купить карты улучшений, которые увеличивают
        характеристики или добавляют новые способности башни. Некоторые карты можно менять во время игры, а некоторые
        лишь только перед запуском новой. За алмазы <VIcon :name="'diamond'" :color="'turq'" /> также есть возможность
        увеличить количество одновременно активированных карт.
      </p>
      <h3>Лаборатория</h3>
      <p>
        Проводя исследования в лаборатории, игрок имеет возможность усилить свою башню. Усиления от лаборатории будут
        работать во всех играх.
      </p>
      <h3>Модули башни</h3>
      <p>
        За алмазы <VIcon :name="'diamond'" :color="'turq'" /> игрок может покупать новые модули для башни, а за монеты
        <VIcon :name="'coins'" :color="'yellow'" /> увеличивать уровень модулей. Модули можно изменять лишь только перед
        началом игры.
      </p>
      <h3>События</h3>
      <p>
        Игрок может выполнять ежедневные и еженедельные задания для получения наград в виде монет
        <VIcon :name="'coins'" :color="'yellow'" />, алмазов <VIcon :name="'diamond'" :color="'turq'" /> и очков
        ультимативных способностей <VIcon :name="'ultimate'" :color="'purple'" />.
      </p>
    </div>
  </div>
</template>

<script setup lang="ts"></script>

<style lang="scss">
  .options__rules {
    display: flex;
    flex-direction: column;
    width: 100%;
    height: 100%;
    &-body {
      flex: 1;
      padding: 1dvh;
      font-size: 1.5rem;
      & h3 {
        width: 100%;
        color: $col-orange;
        text-align: center;
      }
      & p {
        width: 100%;
        margin: 0.4dvh 0;
        font-weight: 400;
        font-size: 1.2rem;
        text-align: justify;
        text-indent: 3dvh;
      }
    }
  }
</style>
